# Merge in SQL

In [1]:
import pandas as pd

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///book.db

'Connected: @book.db'

11/3

## Join Variations

In [13]:
%%sql
SELECT * FROM countries
LIMIT 10

 * sqlite:///book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 ('ASM', 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 ('ATG', 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0)]

In [20]:
%%sql
-- check numbebr of rows
SELECT count(*) FROM countries

 * sqlite:///book.db
Done.

[(217,)]

In [21]:
%%sql
-- check number of rows
SELECT count(*) FROM indicators

 * sqlite:///book.db
Done.

[(12862,)]

In [11]:
%%sql
SELECT * FROM indicators
LIMIT 10

 * sqlite:///book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None),
 (1960, 'ARE', 0.09, None, 52.3, None, None, None),
 (1960, 'ARG', 20.48, None, 65.0, 0.0, 1227.3, 1079.1),
 (1960, 'ARM', 1.87, None, 66.0, 0.0, None, None),
 (1960, 'ASM', 0.02, None, None, 0.0, None, None),
 (1960, 'ATG', 0.05, None, 62.1, 0.0, None, None)]

## Inner Join

Include rows when both tables have corresponding fields based on the match condition (intersection)

In pandas: `df1.merge(df2, on='keyid', how 'inner')`

In sql: 

`SELECT key_variable FROM df1 INNER JOIN df2`

`ON df1.column = df2.column`

In [14]:
%%sql
out << SELECT * FROM countries INNER JOIN indicators
ON countries.code = indicators.code
/*2 code columns: "code" is countries code 
    and "code_1" is indicators code 
    so need to indate where each is from*/

 * sqlite:///book.db
   sqlite:///school.db
Done.
Returning data to local variable out

In [ ]:
#too long since indicating where each column is from

In [15]:
%%sql
out << SELECT countries.code, countries.country, 
countries.region, countries.income, countries.land, 
indicators.year, indicators.pop, indicators.gdp, 
indicators.life, indicators.cell, 
indicators.imports, indicators.exports 
FROM countries INNER JOIN indicators
ON countries.code = indicators.code

 * sqlite:///book.db
   sqlite:///school.db
Done.
Returning data to local variable out

In [ ]:
# nicknmaes for tables

In [16]:
%%sql
out << SELECT co.code, co.country, co.region, co.income, co.land, 
ind.year, ind.pop, ind.gdp, ind.life, ind.cell, ind.imports, ind.exports 
FROM countries AS co INNER JOIN indicators AS ind
ON co.code = ind.code

 * sqlite:///book.db
   sqlite:///school.db
Done.
Returning data to local variable out

**Alternate way to join**

`SELECT key_variable FROM df1 INNER JOIN df2`

`USING (common_column)`

In [37]:
%%sql
out << SELECT co.code, co.country, co.region, co.income, co.land, 
ind.year, ind.pop, ind.gdp, ind.life, ind.cell, ind.imports, ind.exports 
FROM countries AS co INNER JOIN indicators AS ind
USING(code)

 * sqlite:///book.db
Done.
Returning data to local variable out

## Merge on Multiple Fields

In [ ]:
%%sql
out << SELECT co.code, co.country, co.region, co.income, co.land, 
ind.year, ind.pop, ind.gdp, ind.life, ind.cell, ind.imports, ind.exports 
FROM countries AS co INNER JOIN indicators AS ind
ON co.code = ind.code AND co.year = ind.year 
-- if there was a repeat year

## School Database

In [41]:
%sql sqlite:///school.db

'Connected: @school.db'

In [24]:
%%sql -- table names in school database
SELECT name FROM sqlite_master WHERE type='table'

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('subjects',),
 ('instructors',),
 ('departments',),
 ('students',),
 ('courses',),
 ('classes',),
 ('instructor_class',),
 ('student_class',)]

In [ ]:
#Example:
#Find the instrcutors for the classes 21014, 21088, 21256, 21444

#We need the instructor's id, first/last name, department id, class id

In [12]:
%%sql
SELECT instructorfirst, instructorlast, instructorid, departmentid, classid  
FROM instructors INNER JOIN instructor_class
USING(instructorid)
WHERE classid IN (21014, 21088, 21256, 21444)
ORDER BY instructorid

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('Grace', 'Hawkins', 9029, 'PHIL', 21088),
 ('Taylor', 'Price', 9050, 'PHED', 21444),
 ('Jason', 'Garrett', 9146, 'ECON', 21256),
 ('Helen', 'Foster', 9167, 'PSYC', 21014)]

11/7

In [ ]:
#find all classes that these instructors are teaching

In [11]:
%%sql
SELECT instructorfirst, instructorlast, instructorid, departmentid, classid  
FROM instructors INNER JOIN instructor_class
USING(instructorid)
WHERE instructorid IN (9167, 9029, 9146, 9050)

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('Grace', 'Hawkins', 9029, 'PHIL', 21744),
 ('Grace', 'Hawkins', 9029, 'PHIL', 21928),
 ('Grace', 'Hawkins', 9029, 'PHIL', 21085),
 ('Grace', 'Hawkins', 9029, 'PHIL', 21087),
 ('Grace', 'Hawkins', 9029, 'PHIL', 40491),
 ('Grace', 'Hawkins', 9029, 'PHIL', 40490),
 ('Grace', 'Hawkins', 9029, 'PHIL', 21088),
 ('Taylor', 'Price', 9050, 'PHED', 21584),
 ('Taylor', 'Price', 9050, 'PHED', 21444),
 ('Jason', 'Garrett', 9146, 'ECON', 40528),
 ('Jason', 'Garrett', 9146, 'ECON', 40921),
 ('Jason', 'Garrett', 9146, 'ECON', 40527),
 ('Jason', 'Garrett', 9146, 'ECON', 21829),
 ('Jason', 'Garrett', 9146, 'ECON', 21256),
 ('Helen', 'Foster', 9167, 'PSYC', 40420),
 ('Helen', 'Foster', 9167, 'PSYC', 21014),
 ('Helen', 'Foster', 9167, 'PSYC', 21825),
 ('Helen', 'Foster', 9167, 'PSYC', 21013),
 ('Helen', 'Foster', 9167, 'PSYC', 40944),
 ('Helen', 'Foster', 9167, 'PSYC', 40419),
 ('Helen', 'Foster', 9167, 'PSYC', 40423)]

## Joining Multiple Tables

In [ ]:
#Example 1
# classes 21014, 21088, 21256, 21444 and their meeting times,
#in this format: PSYC-100-02    09:30-10L20 MWF

In [18]:
%%sql
SELECT coursesubject || '-' || coursenum || '-' || classsection AS class, 
classmeeting FROM classes 
WHERE classid IN (21014, 21088, 21256, 21444)

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('PSYC-100-02', '09:30-10:20 MWF'),
 ('FYS-102-02', '13:30-14:50 TR'),
 ('ECON-240-01', '11:30-13:20 MW'),
 ('PHED-180-01', None)]

In [ ]:
#Example 1 cont'd
#add instructorlast and instructorfirst to this table

In [23]:
%%sql
SELECT coursesubject || '-' || coursenum || '-' || classsection 
    AS class, classmeeting, instructorlast, instructorfirst
    
FROM classes INNER JOIN instructor_class USING(classid)
INNER JOIN instructors USING (instructorid)
WHERE classid IN (21014, 21088, 21256, 21444)

   sqlite:///book.db
 * sqlite:///school.db
Done.

[('PSYC-100-02', '09:30-10:20 MWF', 'Foster', 'Helen'),
 ('FYS-102-02', '13:30-14:50 TR', 'Hawkins', 'Grace'),
 ('ECON-240-01', '11:30-13:20 MW', 'Garrett', 'Jason'),
 ('PHED-180-01', None, 'Price', 'Taylor')]

## Left Join

In [25]:
%sql sqlite:///book.db

'Connected: @book.db'

Include all rows of the df1 table (the left table)
and, for cases where there is no corresponding code value in the
right table, fill in as missing the values for columns/rows in the right table that have no correspondence

In pandas: `df1.merge(df2, on='keyid', how 'left')`

In sql:

`SELECT key_variable FROM df1 LEFT JOIN df2`

`USING (column)`

## Left Join Example

want to keep countries in indicators that are not in countries table, if use inner join, those countries would be dropped since they aren't shown in both tables

In [28]:
%%sql
SELECT * FROM indicators LEFT JOIN countries
USING (code)
LIMIT 10

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None, 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9, 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3, 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None, 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 (1960, 'AND', 0.01, None, None, 0.0, None, None, 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 (1960, 'ARE', 0.09, None, 52.3, None, None, None, 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 (1960, 'ARG', 20.48, None, 65.0, 0.0, 1227.3, 1079.1, 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 (1960, 'ARM', 1.87, None, 66.0, 0.0, None, None, 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 (1960, 'ASM', 0.02, None, None, 0.0, None, None, 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 (1960, 'ATG', 0.05, None, 62.1, 0.0, None, None, 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0)]

## Right Join

Include all rows of the df2 table (the right
table) and, for cases where there is no corresponding code value in
the left table, fill in as missing the values for columns/rows in the left table that have no correspondence.

In pandas: `df1.merge(df2, on='keyid', how 'right')`

In sql:

`SELECT key_variable FROM df1 RIGHT JOIN df2`

`USING (column)`

## Full Outer Join

Merge all rows from both tables, and fill in as missing for rows/columns in either table that lack a correspondence.

In [17]:
# outer join: keep everything

- left join

`SELECT * FROM df1 LEFT JOIN df2`
`USING (column)`

`UNION` : combine the 2 joins together

- right join

`SELECT * FROM df2 LEFT JOIN df1`
`USING (column)`

## Full Outer Join Example

In [ ]:
# Do a right and left join and concatenate

In [30]:
%%sql
-- left join
SELECT * FROM indicators LEFT JOIN countries
USING (code)

UNION -- combine the 2 together

-- right join
SELECT * FROM countries LEFT JOIN indicators 
USING (code)
LIMIT 10

 * sqlite:///book.db
   sqlite:///school.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None, 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9, 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3, 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None, 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 (1960, 'AND', 0.01, None, None, 0.0, None, None, 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 (1960, 'ARE', 0.09, None, 52.3, None, None, None, 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 (1960, 'ARG', 20.48, None, 65.0, 0.0, 1227.3, 1079.1, 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 (1960, 'ARM', 1.87, None, 66.0, 0.0, None, None, 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 (1960, 'ASM', 0.02, None, None, 0.0, None, None, 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 (1960, 'ATG', 0.05, None, 62.1, 0.0, None, None, 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0)]

## Subqueries

In [ ]:
# average gdp in 2017

In [ ]:
%%sql
SELECT ROUND(AVG(gdp), 2) FROM indicators 
WHERE year=2017
LIMIT 10

In [ ]:
# Example:
# year in 2017 and gdp has  more then average

In [ ]:
%%sql
SELECT * FROM indicators
WHERE year=2017 AND gdp > 
    (SELECT ROUND(AVG(gdp), 2) FROM indicators WHERE year=2017)
LIMIT 10

11/10

## Python String Building
Building a connection string is a matter of using Python string building and incorporating the information from the dictionary.

In the upcoming examples, we use the Python string `format()` method with a pattern string to place the values into their corresponding places.

## Python's `format()` Method

`print('str {x}'.format(x))`

In [1]:
x = 'equal'
print('We are all equal!') #We do not want this
print('We are all' + ' ' + x + '!') # doesn't always work
print('We are all {}!'.format(x)) #use format()

We are all equal!
We are all equal!
We are all equal !

In [4]:
#Index based positioning
x = 'directions'
y = 'the'
z = 'read'
print('{2} {1} {0}'.format(x, y, z))

read the directions

In [10]:
#What does this print print?
print('The first {x} was alright, but the {x} {x} was tough.'
      .format(x = 'second'))
#The first second was alight, but the second second was tough

The first second was alright, but the second second was tough.

In [7]:
%%sql
WHERE year = 2017
'WHERE year = {}'.format(year)

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

## MySQL String Connection Example

Use format() on this: 
"`mysql+mysqlconnector://user:pass@server.college.edu/book`"

In [16]:
#using dictionaries

#this is called creds.json in a text file
creds.json = {"mysql" :{"protocol": "mysqlconnector",
          "host": "server.college.edu",
          "user" : "user",
          "password" : "pass",
          "database" : "book.db"},
 "sqlite" : {"protocal": "sqlite+pysqlite",
            "path" : "dir/book.db"}
}
#open json file
with open('\dir\creds.json', 'r') as file:
    creds = json.load(file)
mysqlID = creds['mysql']
pattern = "{}://{}:{}@{}/{}"
cstring = pattern.format(mysqlID["protocol"], mysqlID["user"],
                        mysqlID["password"], mysqlID["host"],
                        mysqlID["database"])

FileNotFoundError: [Errno 2] No such file or directory: 'creds'

"`sqlite+psyqlite:///datadir/book.db`"

In [ ]:
#open json file
with open('\dir\creds.json', 'r') as file:
    creds = json.load(file)
sqliteID = creds['sqlite']
pattern = "{}:///{}"
cstring = pattern.format(sqliteID["protocol"], 
                         sqliteID["path"])

In [3]:
! pip install sql alchemy

Requirement already satisfied: sql in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (2022.4.0)
Requirement already satisfied: alchemy in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (20.5)
Requirement already satisfied: filelock==3.0.12 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from alchemy) (3.0.12)
Requirement already satisfied: requests==2.22.0 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from alchemy) (2.22.0)
Requirement already satisfied: python-daemon==2.2.4 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from alchemy) (2.2.4)
Requirement already satisfied: lockfile>=0.10 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from python-daemon==2.2.4->alchemy) (0.12.2)
Requirement already satisfied: docutils in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from python-daemon==2.2.4->alchemy) (0.17.1)
Requirement already satisfied: setuptools in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from python-daemon==2.2.4->alchemy) (61.2.0)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from requests==2.22.0->alchemy) (1.25.11)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from requests==2.22.0->alchemy) (3.0.4)
Requirement already satisfied: idna<2.9,>=2.5 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from requests==2.22.0->alchemy) (2.8)
Requirement already satisfied: certifi>=2017.4.17 in /Users/chloeschnydman/opt/anaconda3/lib/python3.9/site-packages (from requests==2.22.0->alchemy) (2021.10.8)

## Connecting

In [11]:
import sqlalchemy as sa

In [25]:
#file = open('/Users/chloeschnydman/Downloads/Data200_Fall22/data/book.db')
engine = sa.create_engine('sqlite+pysqlite:///book.db')
connection = engine.connect()

In [26]:
query = 'SELECT * FROM indiactors0'

In [27]:
result_proxy = connection.execute(query)

OperationalError: (sqlite3.OperationalError) no such table: indiactors0
[SQL: SELECT * FROM indiactors0]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [10]:
results_all = result_proxy.fetchall()

NameError: name 'result_proxy' is not defined

In [9]:
results_all

NameError: name 'results_all' is not defined

In [ ]:
result_proxy.keys() # check columns in table

In [33]:
import pandas as pd

In [ ]:
fields = result_proxy.keys()
ind0 = pd.DataFrame(results_all, columns = fields)
ind0

`pd.read_sql_table('table', con = connection)` : request a database directly from Pandas

In [28]:
#read entire table
ind0_2 = pd.read_sql_table('indicators0', con = connection) #in pandas
ind0_2

  code      pop       gdp  life     cell
0  CHN  1386.40  12143.50  76.4  1469.88
1  FRA    66.87   2586.29  82.5    69.02
2  GBR    66.06   2637.87  81.2    79.10
3  IND  1338.66   2652.55  68.8  1168.90
4  USA   325.15  19485.40  78.5   391.60

In [29]:
#read part of table (query)
query = '''
SELECT code, pop, gdp FROM indicators0
WHERE life>78
'''

ind0_3 = pd.read_sql_query(query, con= connection)
ind0_3

  code     pop       gdp
0  FRA   66.87   2586.29
1  GBR   66.06   2637.87
2  USA  325.15  19485.40

In [30]:
query = '''
SELECT name FROM sqlite_master
WHERE type='table'
'''

ind0_3 = pd.read_sql_query(query, con= connection)
ind0_3

          name
0    countries
1   indicators
2  indicators0
3     topnames

In [35]:
def indicators_life(dbcon, t):
    engine = sa.create_engine('sqlite+pysqlite:///book.db')
    dbcon = engine.connect()
    query_template = '''
    SELECT code, pop, gdp FROM indicators0
    WHERE life>{}
    '''
    query = query_template.format(t)
    df = pd.read_sql_query(query, con = dbcon)
    return df

In [36]:
indicators_life(connection, 80)

  code    pop      gdp
0  FRA  66.87  2586.29
1  GBR  66.06  2637.87

## Binding Variables

In [37]:
pyquery = '''
SELECT code, pop, gdp FROM indicators0
WHERE life>:t
'''
prepare_stmt = sa.sql.text(pyquery)

In [38]:
bound_stmt = prepare_stmt.bindparams(t = 70)
pd.read_sql_query(bound_stmt, connection)

  code      pop       gdp
0  CHN  1386.40  12143.50
1  FRA    66.87   2586.29
2  GBR    66.06   2637.87
3  USA   325.15  19485.40

In [41]:
# fetchone() : 
# fetchmany() : won'r be returned entire table, chart a part of it

In [39]:
chunck_size = 2
iterator = pd.read_sql_query(query, connection, chunksize = chunck_size)

In [40]:
for df in iterator:
    print(df)

         name
0   countries
1  indicators
          name
0  indicators0
1     topnames

In [ ]:
del engine